tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Rule-based custom proxy with GUI based on clash
cask "clashx"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "库乐队", id: 682658836
